'''
1. Задайте строку из набора чисел. Напишите программу, 
которая покажет большее и меньшее число. В качестве символа-разделителя используйте пробел.
'''

a = 4
print(a)
